package pa0923리스트정리;
/*세번째 과제
 * 
 * 이름0923_2.java
 * 
 * q1) 팩토리얼 재귀  재귀함수이름(factorial)
 * 팩토리얼
 * 5!   => 5*4*3*2*1
 * 8!   => 8*7*6*5*4*3*2*1
 * 
 * q2) 두 수 x,y를 입력받아 x의 y거듭제곱(승)을 구하시오(재귀) power
 * x 2 , y 5
 * 2*2*2*2*2 => 2의 5승
 * x4, y 5, => 4*4*4*4*4 => 4의 5승 
 * 
 * 플러스 문제
 * q3) 피보나치 수열 -> 앞 두개의 수의 합이 다음숫자가 되는것
 * ex)1  1  이면 세번째는 2 이후는 더한 3 이후 5 이후 8 이후 
 * 8 13 21 34 55   (fibonacci)
 * fibonacci(5) => 5
 * fibonacci(7) => 13
 * fibonacci(8) => 21 이런식으로 나옴
 * 반복문 1~10번째까지의 수열 출력 과제는 2번까지해도 되지만 3까지 해도좋음
 * 
 */
public class Quiz재귀퀴즈 {

}
